tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"

# 중요! 이 줄이 없으면, ~/Applications에 설치하므로 꼭 넣어야 한다.
cask_args appdir: '/Applications'

brew "asciiquarium"
brew "python@3.11"
brew "autojump"
brew "bitwarden-cli"
brew "cmatrix"
brew "qemu"
brew "lima"
brew "colima"
brew "harfbuzz"
brew "h2", restart_service: true
brew "mongosh"
brew "mysql"
brew "neofetch"
brew "nginx"
brew "pipenv"
brew "poetry"
brew "pstree"
brew "pyenv"
brew "starship"
brew "tcptrace"
brew "tree"
brew "mongodb/brew/mongodb-community"
cask "arc"
cask "brave-browser"
cask "cheatsheet"
cask "cursor"
cask "dbeaver-community"
cask "fig"
cask "firefox"
cask "flutter"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboard-cleaner"
cask "maccy"
cask "microsoft-edge"
cask "mysqlworkbench"
cask "ngrok"
cask "postman"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
cask "wireshark"
cask "zulu"
cask "zulu11"
cask "zulu17"
cask "zulu8"
vscode "akamud.vscode-theme-onedark"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "PKief.material-icon-theme"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WakaTime.vscode-wakatime"
vscode "withfig.fig"
